Revit 2025 API
ElectricalPerPhaseData.CurrentPhaseA Property
 The value of current on electrical phase A.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double CurrentPhaseA { get; }
Public ReadOnly Property CurrentPhaseA As Double
	Get
public:
property double CurrentPhaseA {
	double get ();
}
member CurrentPhaseA : float with get
Property Value
Double
See Also
Reference
ElectricalPerPhaseData Class
Autodesk.Revit.DB.Electrical Namespace